{"cards_data": "### *Pixel Go Card*\n\n*Eligibility:*\n\n- *For Salaried:*\n  - *Age:* Min 21 yrs & Max 60 yrs\n  - *Income:* Gross Monthly Income > ₹8,000\n  - *Nationality:* Indian\n\n- *For Self Employed:*\n  - *Age:* Min 21 yrs & Max 65 yrs\n  - *Income:* ITR > ₹6.0 Lakhs per annum\n  - *Nationality:* Indian\n\n*Features:*\n\n- *1% unlimited cashback* on all eligible transactions.\n- *Flexible EMIs*: Shop now and pay in parts with low-cost EMIs.\n- *Exclusive dining offers*: Up to 25% discount on partner restaurants via Swiggy Dineout.\n- *Control via PayZap*: Apply and manage your Pixel Credit Card on the PayZap app.\n\n### *HDFC Bank Millennia Credit Card*\n\n*Eligibility:*\n\n- *For Salaried:*\n  - *Age:* Min 21 yrs & Max 40 yrs\n  - *Income:* Net Monthly Income > ₹35,000\n  - *Nationality:* Indian\n\n- *For Self Employed:*\n  - *Age:* Min 21 yrs & Max 40 yrs\n  - *Income:* ITR > ₹6.0 Lakhs per annum\n  - *Nationality:* Indian\n\n*Features:*\n\n- *5% cashback* on Amazon, BookMyShow, Cult.fit, Flipkart, Myntra, Sony LIV, Swiggy, Tata CLiQ, Uber, and Zomato.\n- *1% cashback* on all other spends (except fuel), including EMI and wallet transactions.\n- *₹1,000 worth of gift vouchers* on spends of ₹1,00,000 and above in each calendar quarter.\n\n### *Business Card*\n\n*Features:*\n\n- *Up to 55 days interest-free* period.\n- *5X reward points* on bill payments via PayZapp/SmartPay, Income Tax, GST & vendor payments via Swifti & SmartHub Vyapar, SmartBuy BizDeals.\n- *Unlimited airport lounge access.*\n- *6 complimentary golf games* every quarter.\n- *Welcome benefits*: Complimentary annual membership of Club Marriott & Taj Stay Voucher worth ₹5,000 on spends of ₹1.5 lakh within the first 90 days.\n- *Milestone benefits*: Flight tickets/Taj Hotels Stay Voucher worth up to ₹5,000 on every ₹5 lakhs & above spends, and a voucher worth ₹20,000 in a calendar year.\n- *Reward points*: 5 reward points for every ₹150 spent (1 reward point = up to ₹1).\n- *24x7 personal concierge service*.\n\n### *Corporate Premium Credit Card*\n\n*Features:*\n\n- *5 reward points* for every ₹150 spent on your card.\n- *Complimentary airport lounge access*: 5 domestic visits per quarter and 6 international visits per year through Priority Pass.\n- *Accident insurance cover*: ₹1 crore for air travel and ₹3 lakhs for road and rail travel.\n\n### *Millennia Debit Card*\n\n*Features:*\n\n- *Insurance Cover:*\n  - *Personal Accident Death Cover:*\n    - *Base Cover:* ₹5 lakh for Death by Air/Road/Rail Accident.\n    - *Accelerated Cover:* Additional up to ₹5 lakh, subject to minimum transactions at merchant locations/online.\n  - *International Air Accident Cover:* ₹1 Crore on purchase of an air ticket using the Debit Card.\n  - *Zero Liability:* No liability for fraudulent Point of Sale transactions up to 90 days prior to reporting the card loss.\n  - *Note:* Insurance policy applies to the card with the highest POS amount in case of multiple cards.\n\n- *Eligibility:*\n  - Savings Account\n  - Current Account\n  - SuperSaver Account\n  - Loan Against Shares Account (LAS)\n  - Salary Account\n  - Individual Account Holders (Savings Account, Corporate Salary Accounts & Senior Citizens)\n\n- *Additional Features:*\n  - *Get up to ₹4,800 cashback* every year.\n  - *5% cashback* on shopping via PAYZAPP & SmartBUY.\n  - *2.5% cashback* on all online spends.\n  - *1% cashback* on all offline spends and wallet reloads.\n\n### *Imperia Platinum Debit Card / Preferred Platinum Debit Card*\n\n*Features:*\n\n- *Daily limit:* ₹1 lakh for ATM withdrawals and ₹5 lakhs for retail/online shopping.\n- *Up to 1% cashback* on retail and online shopping (Max ₹750/month).\n- *Personal Accidental Death Cover:* Up to ₹12 lakhs (rail, road, or air).\n\n### *Business Debit Card*\n\n*Features:*\n\n- *Tracking:* Designed for Current Account holders to easily track expenses.\n- *Cashback points:* On all online and offline shopping.\n- *Complimentary airport lounge access* at select airports.\n\n### *Woman's Advantage Debit Card*\n\n*Features:*\n\n- *Cashback points:* Earn 1 cashback point (up to ₹750 a month) for every ₹200 spent.\n- *Locker facility:* 50% off at HDFC Bank branches for the first year.\n- *Personal Accident Death Cover:* Up to ₹5 lakhs (rail, road, or air).\n\n### *Gold Debit Card*\n\n*Features:*\n\n- *Cashback:* 1% cashback (up to ₹750 a month) on offline and online spends.\n- *Fuel savings:* Up to ₹250 a month at select outlets.\n- *Daily limit:* ₹1 lakh for ATM withdrawals and ₹2.75 lakhs for retail/online shopping.\n", "loans_data": "\nHere's a deeper look into each of the major loan categories offered by HDFC Bank:\n\n### 1. **Home Loans**\n\n**Interest Rates & Schemes:**\n   - **General Rates:** Interest rates typically range between 8.95% to 9.85%, depending on the borrower's profile, loan amount, and tenure.\n   - **Women Applicants:** Women borrowers often enjoy a lower interest rate, around 0.05% less than the general rate.\n   - **Special Schemes:** HDFC offers specialized loan products like **Home Extension Loans** (for home renovations or expansions) and **Top-Up Loans** (additional loans over the existing home loan). The bank also provides **TruFixed Home Loans** which offer a fixed interest rate for a certain period before switching to a floating rate.\n   - **Eligibility:** Eligibility factors include age, income, employment status, credit score, and the value of the property. Self-employed and salaried individuals have different criteria, with salaried individuals typically finding it easier to qualify.\n\n**Loan Amount & Tenure:**\n   - **Loan Amount:** You can finance up to 90% of the property value, but this can vary based on the loan amount and property type.\n   - **Tenure:** Up to 30 years, with the option to adjust the tenure based on your repayment capability, which directly affects the EMI.\n\n**Processing & Fees:**\n   - **Processing Fees:** Usually up to 1.2% of the loan amount, plus applicable taxes.\n   - **Prepayment:** Partial prepayment is allowed, with no penalty on floating-rate loans. Prepayment penalties may apply for fixed-rate loans.\n\n### 2. **Personal Loans**\n\n**Interest Rates & Features:**\n   - **Interest Rates:** Start from 10.75% and can go up to 24%, with the rate fixed for the tenure of the loan.\n   - **Special Offers:** Government employees and HDFC Bank account holders may receive lower interest rates and special deals.\n   - **Loan Amount:** Can go up to ₹40 lakhs, depending on the borrower's eligibility. Some customers may qualify for up to ₹75 lakhs under special conditions.\n\n**Eligibility & Tenure:**\n   - **Eligibility:** A CIBIL score of 720 or above is typically required. The applicant should be between 21 to 60 years old, with a stable income source. Self-employed individuals may need to provide additional documentation to prove income stability.\n   - **Tenure:** Between 12 to 72 months, offering flexibility in repayment options.\n\n**Processing Fees & Features:**\n   - **Processing Fees:** Up to ₹4,999 plus GST.\n   - **Insurance:** Optional insurance covers such as Sarv Suraksha Pro offer credit shield, accidental hospitalization, and accidental death coverage.\n   - **Balance Transfer:** Existing loans can be transferred to HDFC Bank for lower EMIs, with interest rates as low as 10.65% p.a.\n\n### 3. **Car Loans**\n\n**Interest Rates & Schemes:**\n   - **Interest Rates:** Typically range from 8.60% to 14.50%, based on the borrower’s profile, vehicle type, and loan tenure.\n   - **Loan Amount:** Can finance up to 100% of the on-road price of select car models.\n   - **Special Schemes:** HDFC Bank offers **Flexi Car Loans**, which allow flexibility in repayments, and **Top-Up Car Loans** for existing customers looking for additional financing.\n\n**Tenure & Eligibility:**\n   - **Tenure:** Up to 7 years.\n   - **Eligibility:** Both salaried and self-employed individuals can apply. Eligibility is assessed based on income, credit score, and the value of the car.\n\n**Processing Fees & Features:**\n   - **Processing Fees:** Typically 1% of the loan amount.\n   - **Fast Approval:** Quick processing with minimal documentation and instant loan disbursal for pre-approved customers.\n\n### 4. **Two-Wheeler Loans**\n\n**Interest Rates & Schemes:**\n   - **Interest Rates:** Start at around 11% p.a., making it an affordable option for financing a two-wheeler.\n   - **Loan Amount:** Up to 100% of the vehicle's on-road price, depending on the borrower’s profile and vehicle type.\n   - **Special Offers:** HDFC Bank sometimes provides seasonal discounts or special rates for specific two-wheeler brands or models.\n\n**Tenure & Eligibility:**\n   - **Tenure:** From 12 to 36 months, offering flexibility based on the borrower’s repayment capacity.\n   - **Eligibility:** Salaried individuals and self-employed professionals can apply. Eligibility is determined by income, credit history, and the cost of the vehicle.\n\n**Processing & Fees:**\n   - **Processing Fees:** Typically around 2-3% of the loan amount, with quick processing and minimal documentation required.\n\n### 5. **Loan Against Property (LAP)**\n\n**Interest Rates & Schemes:**\n   - **Interest Rates:** Typically start around 9.75% p.a., offering a lower cost of borrowing compared to unsecured loans.\n   - **Loan Amount:** Can be up to 60% of the property’s market value, depending on the borrower’s profile and the property's location.\n\n**Eligibility & Tenure:**\n   - **Eligibility:** Available to both salaried and self-employed individuals. Key criteria include stable income, a good credit score, and clear property title.\n   - **Tenure:** Up to 15 years, allowing for manageable EMIs.\n\n**Processing Fees & Features:**\n   - **Processing Fees:** Around 1% to 1.5% of the loan amount, with additional fees for legal and technical verification of the property.\n   - **Top-Up Loans:** Existing LAP customers may be eligible for additional financing based on their repayment history and property value.\n", "wealth_data": "\n*Savings and Fixed Deposit Options*\n\n- *Fixed Deposit (FD)*\n  - Open an FD with a minimum amount of ₹5,000.\n  - Use as a backup for your savings or current account with Sweep-in and Super Saver Facilities.\n  - Easy and convenient to open or liquidate whenever necessary.\n\n- *Healthcare FD*\n  - Minimum FD amount: ₹5 lakhs; Maximum FD amount: ₹2.99 crores.\n  - Flexible tenure: Minimum tenure of 1 year, maximum tenure of 10 years.\n  - Interest rates are the same as Regular Fixed Deposits.\n\n- *Recurrent FD*\n  - Invest as little as ₹500 (and in multiples of ₹100 thereafter) or up to ₹2,99,99,900 per month.\n  - Minimum tenure of 6 months (and in multiples of 3 months thereafter) up to a maximum of 10 years.\n  - For NRI customers, the minimum tenure is 12 months.\n  - Earn interest rates equal to that of regular Fixed Deposits with smaller monthly investments.\n\n- *Women Savings Account*\n  - Get an EasyShop Woman’s Debit Card for all your spending needs.\n  - Earn up to ₹1 cashback on every ₹200 spent.\n  - Enjoy up to 3.5% lower interest rates on two-wheeler loans.\n\n- *Senior Citizen Account*\n  - Accident hospitalization reimbursement cover of ₹50,000 per annum.\n  - Daily cash allowance of ₹500 per day for 15 days of hospitalization.\n  - Enjoy preferential rates on fixed deposits (FDs).\n", "issurance_data": "\n### 1. **HDFC Life Click 2 Protect Life**\n\n- **Life Option:** This basic option provides a sum assured to the nominee upon the policyholder's death. The policyholder can choose the sum assured and the policy term. This option is ideal for those looking for straightforward life coverage without frills.\n  - **Eligibility:** Available for individuals aged between 18 and 65 years.\n  - **Sum Assured:** Minimum ₹50,00,000 with no upper limit, depending on the underwriting decision.\n  - **Policy Term:** 5 to 85 years.\n  - **Premium Payment:** Options include regular, limited, or single premium payment.\n\n- **3D Life Option:** This variant covers three scenarios—death, disability, and disease (critical illness). It provides an additional sum assured if the policyholder is diagnosed with a critical illness or is permanently disabled due to an accident.\n  - **Critical Illnesses Covered:** Includes a range of diseases such as cancer, heart attack, stroke, and major organ transplants.\n  - **Disability Cover:** Waives all future premiums if the policyholder is permanently disabled.\n\n- **Return of Premium Option:** If the policyholder survives the policy term, all premiums paid are refunded, making it a suitable option for those who want a return on their investment in addition to life cover.\n\n- **Additional Riders:**\n  - **Accidental Death Benefit Rider:** Pays an additional sum assured in case of death due to an accident.\n  - **Income Benefit on Accidental Disability Rider:** Provides regular income for 10 years in case of permanent disability due to an accident.\n\n### 2. **HDFC Life Sanchay Plus**\n\n- **Guaranteed Maturity Benefit:** This plan guarantees a lump sum at maturity, making it a safe investment for long-term savings goals like a child's education or marriage.\n  - **Maturity Benefit:** Guaranteed lump sum at the end of the policy term, based on the premium payment and policy duration.\n  - **Policy Term:** Ranges from 5 to 20 years.\n  - **Premium Payment:** Can be done annually, semi-annually, quarterly, or monthly.\n\n- **Guaranteed Income Benefit:** Provides regular income for a specified period post the premium payment term. This income can be used to fund retirement or other long-term financial needs.\n  - **Income Period:** Options range from 10 to 40 years.\n  - **Death Benefit:** In case of death during the income period, the nominee receives the sum assured or the remaining income payouts.\n\n- **Lifetime Income Option:** Offers a regular income for life, making it ideal for those looking for a steady income stream post-retirement.\n  - **Joint Life Option:** Allows the inclusion of a spouse to receive the income after the policyholder's death.\n\n### 3. **HDFC Life Click 2 Wealth**\n\n- **Self-Managed Option:** Allows policyholders to manage their investments by choosing from various equity, debt, and balanced funds. This option is ideal for those who are investment-savvy and want control over their portfolio.\n  - **Funds Available:** A wide range including Equity Plus Fund, Balanced Fund, Bond Fund, and Conservative Fund.\n  - **Fund Switching:** Flexibility to switch between funds at no additional cost.\n\n- **Systematic Transfer Plan:** Designed for risk-averse investors, this option gradually transfers funds from a debt-oriented fund to an equity-oriented fund, reducing the impact of market volatility.\n  - **Automatic Transfer:** Monthly transfers from the Conservative Fund to the Equity Plus Fund, aiming to average out market highs and lows.\n\n- **Return of Mortality Charges:** Unlike most ULIPs where mortality charges are deducted and not returned, this plan refunds the total mortality charges at the end of the policy term, enhancing the overall returns.\n  - **Benefits:** Policyholders get back the life cover charges paid over the years, thus improving the value of their investment.\n\n### 4. **HDFC Life Pension Guaranteed Plan**\n\n- **Immediate Life Annuity:** Ideal for individuals who want to start receiving regular income immediately after paying a lump sum premium. This is often chosen by retirees who need a steady income stream.\n  - **Annuity Options:** Options include lifetime income, joint life, and increasing annuity, where the income increases by a fixed percentage every year.\n\n- **Deferred Annuity:** Suitable for those who want to invest a lump sum now and start receiving an annuity after a certain deferment period, which can be selected by the policyholder.\n  - **Deferment Period:** Typically ranges from 1 to 10 years.\n  - **Guaranteed Income:** Provides a fixed income for life after the deferment period, ensuring a stable post-retirement life.\n\n- **Joint Life Annuity:** Provides coverage for both the policyholder and their spouse. After the policyholder's death, the spouse continues to receive the annuity for life.\n  - **Variants:** Options include 100% annuity to the spouse, or a reduced annuity to the spouse after the policyholder's death.\n\n### 5. **HDFC ERGO Health Optima Restore**\n\n- **Restore Benefit:** If the sum insured is exhausted during the policy year, it is automatically reinstated at no extra cost, ensuring continuous coverage without the need to buy additional insurance.\n  - **Example:** If you have a ₹5 lakh cover and make a claim of ₹5 lakh, the restore benefit reinstates your sum insured to ₹5 lakh.\n\n- **Multiplier Benefit:** Increases the sum insured by 50% after every claim-free year, and doubles it after two consecutive claim-free years, effectively giving you up to 200% of the original sum insured.\n  - **Eligibility:** Available after two consecutive claim-free years.\n  \n- **Day Care Treatments:** Covers 540+ medical procedures that do not require 24-hour hospitalization, such as cataract surgery, chemotherapy, and dialysis.\n\n- **No Claim Bonus:** Policyholders earn a no-claim bonus for every year without a claim, which increases the sum insured.\n\n### 6. **HDFC ERGO Critical Illness Insurance**\n\n- **Coverage:** Provides a lump sum payout on the diagnosis of any of the 15-30 listed critical illnesses, which include major conditions like cancer, heart attack, stroke, kidney failure, and major organ transplants.\n  - **No Survival Period:** Some plans offer payouts immediately upon diagnosis, without requiring the policyholder to survive a certain period after diagnosis.\n\n- **Benefits:** The lump sum amount can be used for any purpose, including treatment, recovery, and even day-to-day expenses or loan repayments, offering financial freedom during a challenging time.\n\n- **Renewability:** The plan is renewable for life, ensuring coverage even as you age.\n\n### 7. **HDFC ERGO Motor Insurance**\n\n- **Zero Depreciation Cover:** Ensures that during a claim, no depreciation is deducted on the parts of the vehicle being replaced, leading to higher claim payouts.\n  - **Eligibility:** Usually applicable to cars that are less than 5 years old.\n\n- **Engine Protector:** Provides coverage for engine damages caused by water ingression or oil leakage, which are not typically covered under standard car insurance policies.\n  - **Benefit:** Crucial during monsoon seasons or in flood-prone areas.\n\n- **Return to Invoice:** In case of total loss or theft of the vehicle, this add-on ensures you receive the full invoice value of the car, including road tax and registration, rather than just the depreciated value.\n  - **Scope:** Ideal for new car owners to protect their investment.\n\n", "fixed_Deposits_data": "\nHere is a detailed breakdown of each Fixed Deposit (FD) scheme offered by HDFC Bank:\n\n### 1. **Regular Fixed Deposit**\n   - **Minimum Deposit:** ₹5,000\n   - **Tenure:** Ranges from 7 days to 10 years, offering flexibility for both short-term and long-term savings.\n   - **Interest Rates:** Vary depending on the tenure, generally offering competitive rates. Senior citizens receive an additional 0.50% interest rate over the standard rates.\n   - **Interest Payout Options:** Monthly, quarterly, or reinvestment. Reinvestment allows interest to be added to the principal, compounding over time.\n   - **Premature Withdrawal:** Available with a penalty on the interest rate. Auto-renewal is an option at maturity.\n   - **Booking:** Can be easily booked online via HDFC Bank’s website, mobile app, or net banking.\n\n### 2. **SureCover FD**\n   - **FD Amount:** Between ₹2 lakh and ₹10 lakh.\n   - **Tenure:** Flexible, ranging from 1 year to 10 years.\n   - **Special Features:** This FD combines investment with life insurance. Depositors get a life insurance cover equivalent to the principal amount for the first year. The interest rates are the same as the regular FD scheme, making it a secure investment with added insurance benefits.\n   - **Interest Payout Options:** Monthly, quarterly, or reinvestment.\n\n### 3. **Five-Year Tax Saving Fixed Deposit**\n   - **Minimum Deposit:** ₹100.\n   - **Maximum Deposit:** ₹1.5 lakh per financial year.\n   - **Tenure:** 5 years, with a mandatory lock-in period.\n   - **Tax Benefits:** Eligible for tax deductions under Section 80C of the Income Tax Act, reducing taxable income. Interest earned is taxable.\n   - **Eligibility:** Available to resident individuals and Hindu Undivided Families (HUFs).\n   - **Interest Payout Options:** Monthly or quarterly. The interest earned cannot be withdrawn before maturity.\n\n### 4. **Direct Deposit FD**\n   - **Minimum Deposit:** ₹5,000.\n   - **Special Features:** This FD can be opened without having a savings account with HDFC Bank, offering flexibility. It includes auto-renewal and premature withdrawal options.\n   - **Funding Modes:** UPI (up to ₹1 lakh), NEFT (up to ₹25 lakhs). The FD can be booked through HDFC Bank's digital booking portal, with eKYC and video KYC options available.\n\n### 5. **Overdraft Against Fixed Deposits**\n   - **Purpose:** This option allows depositors to borrow up to 90% of their FD amount to meet immediate financial needs without breaking the FD.\n   - **Minimum FD Amount:** ₹25,000.\n   - **Tenure for Overdraft:** Minimum of 6 months and 1 day.\n   - **Interest Payment:** Interest is only paid on the amount drawn as an overdraft, allowing the remaining FD to continue earning interest. The overdraft facility can be availed instantly via HDFC Bank's NetBanking.\n\n### 6. **Special Tenure Fixed Deposits**\n   - **Tenure:** Two specific options are available: 35 months (2 years 11 months) and 55 months (4 years 7 months).\n   - **Interest Rates:** 7.20% for the 35-month tenure and 7.25% for the 55-month tenure. Senior citizens can avail an additional interest margin of up to 0.5%.\n   - **Special Features:** These tenures are designed for customers looking for higher returns over a fixed period, ideal for those looking to secure their money for medium to long-term durations with assured high returns.\n"}